11/data/attachments/423b072880aff6b8.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_cccdb5a6-ee86-4345-91c9-d1cf209bb9ab</nif:username>
            <nif:friendToBeAdded>Chris_shake_Friend_83571_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>